In [2]:
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv('studentlist01.csv')
df

   username    firstname   lastname                   email
0       NaN    Christian      Cunha  chris.acunha@Yahoo.com
1       NaN        Brett     Lowder     blowder66@gmail.com
2       NaN       Emily       Masse      emasse20@Yahoo.com
3       NaN       Andrew  Sarnevitz    asarnevitz@gmail.com
4       NaN         Mark   Sweitzer   msweitzeriv@Yahoo.com
5       NaN          Dan     Blount     dblount70@gmail.com
6       NaN  Christopher   Mahatcek  cmahatcek678@g.rwu.edu

In [17]:
for i in df.index:
    usrname = df.loc[i,'firstname'][0].lower() + df.loc[i,'lastname'].lower()
    df.loc[i, 'username'] = usrname

In [18]:
df

     username    firstname   lastname                   email
0      ccunha    Christian      Cunha  chris.acunha@Yahoo.com
1     blowder        Brett     Lowder     blowder66@gmail.com
2      emasse       Emily       Masse      emasse20@Yahoo.com
3  asarnevitz       Andrew  Sarnevitz    asarnevitz@gmail.com
4   msweitzer         Mark   Sweitzer   msweitzeriv@Yahoo.com
5     dblount          Dan     Blount     dblount70@gmail.com
6   cmahatcek  Christopher   Mahatcek  cmahatcek678@g.rwu.edu

In [193]:
text_array = df.to_numpy()
np.savetxt('chapter19_corrected.txt', text_array, delimiter=" ", fmt="%s")